
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.instance_main will be updated in-place
  ~ resource "aws_instance" "instance_main" {
        id                                   = "i-0ca681d3705c25799"
        tags                                 = {
            "Name" = "hosting-temp-instance-main"
        }
      ~ vpc_security_group_ids               = [
          - "sg-02b4c245efb94a59b",
            # (1 unchanged element hidden)
        ]
        # (39 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # aws_security_group_rule.sgrule_main_adminaccess must be replaced
-/+ resource "aws_security_group_rule" "sgrule_main_adminaccess" {
      ~ cidr_blocks              = [ # forces replacement
          - "62.36.0.153/32",
          + "173.245.48.0/20",
          + "103.21.244.0/22",
          + "103.22.200.0/22",
          + "103.31.4.0/22",
          + "141.101.64.0/18",
          + "108.162.192.0/18",
          + "190.93.240.0/20",
          + "188.114.96.0/20",
          + "197.234.240.0/22",
          + "198.41.128.0/17",
          + "162.158.0.0/15",
          + "104.16.0.0/13",
          + "104.24.0.0/14",
          + "172.64.0.0/13",
          + "131.0.72.0/22",
        ]
      ~ id                       = "sgrule-2263330882" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0026f2151e29449f0" -> (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_security_group_rule.sgrule_main_ipv4 must be replaced
-/+ resource "aws_security_group_rule" "sgrule_main_ipv4" {
      ~ cidr_blocks              = [ # forces replacement
          - "173.245.48.0/20",
          - "103.21.244.0/22",
          - "103.22.200.0/22",
          - "103.31.4.0/22",
          - "141.101.64.0/18",
          - "108.162.192.0/18",
          - "190.93.240.0/20",
          - "188.114.96.0/20",
          - "197.234.240.0/22",
          - "198.41.128.0/17",
          - "162.158.0.0/15",
          - "104.16.0.0/13",
          - "104.24.0.0/14",
          - "172.64.0.0/13",
          - "131.0.72.0/22",
          + "62.36.0.153/32",
        ]
      ~ id                       = "sgrule-974403753" -> (known after apply)
      + security_group_rule_id   = (known after apply)
      + source_security_group_id = (known after apply)
        # (8 unchanged attributes hidden)
    }

  # null_resource.null_ansible_main is tainted, so must be replaced
-/+ resource "null_resource" "null_ansible_main" {
      ~ id       = "5211614990730646578" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
